In [38]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [5]:
# 创建Series
series=Series(data=[89,87,85],index=[u'语文',u'数学',u'英语'])

In [6]:
print(series)

语文    89
数学    87
英语    85
dtype: int64

In [8]:
print(u"series['语文']=",series[u'语文'])

series['语文']= 89

In [9]:
print("series[0]=",series[0])

series[0]= 89

In [10]:
print("series[-1]=",series[-1])

series[-1]= 85

In [11]:
print(series[1:])

数学    87
英语    85
dtype: int64

In [12]:
print(series[u'语文':u'数学'])

语文    89
数学    87
dtype: int64

In [13]:
# 创建series
series=Series({'20170801':6875.0,
              '20170802':1239.2,
              '20170803':9456.2})

In [14]:
print(series)

20170801    6875.0
20170802    1239.2
20170803    9456.2
dtype: float64

In [15]:
print(series[series>5000])

20170801    6875.0
20170803    9456.2
dtype: float64

In [16]:
print(series/100)

20170801    68.750
20170802    12.392
20170803    94.562
dtype: float64

In [17]:
#创建Series
series=Series([-1,-2,3,4])

In [18]:
print(series)

0   -1
1   -2
2    3
3    4
dtype: int64

In [21]:
print(np.exp(series))

0     0.367879
1     0.135335
2    20.085537
3    54.598150
dtype: float64

In [22]:
print(np.fabs(series))

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [23]:
#创建Series
s1=Series([12,23,45],index=['p1','p2','p3'])
s2=Series([54,43,32,21],index=['p2','p3','p4','p5'])

In [24]:
print(s1+s2)

p1     NaN
p2    77.0
p3    88.0
p4     NaN
p5     NaN
dtype: float64

In [25]:
print(s1*s2)

p1       NaN
p2    1242.0
p3    1935.0
p4       NaN
p5       NaN
dtype: float64

In [26]:
print(s1/s2)

p1         NaN
p2    0.425926
p3    1.046512
p4         NaN
p5         NaN
dtype: float64

In [27]:
#创建Series
scores=Series({"Tom":89,"John":88,"Merry":96,"Max":65})

In [28]:
print(scores)

Tom      89
John     88
Merry    96
Max      65
dtype: int64

In [29]:
new_index=["Tom","Max","Joe","John","Merry"]
scores=Series(scores,index=new_index)

In [30]:
print(scores)

Tom      89.0
Max      65.0
Joe       NaN
John     88.0
Merry    96.0
dtype: float64

In [31]:
pd.isnull(scores)

Tom      False
Max      False
Joe       True
John     False
Merry    False
dtype: bool

In [32]:
pd.notnull(scores)

Tom       True
Max       True
Joe      False
John      True
Merry     True
dtype: bool

In [33]:
scores[pd.isnull(scores)]

Joe   NaN
dtype: float64

In [34]:
scores[pd.notnull(scores)]

Tom      89.0
Max      65.0
John     88.0
Merry    96.0
dtype: float64

In [35]:
scores['Joe']=-1
print(scores)

Tom      89.0
Max      65.0
Joe      -1.0
John     88.0
Merry    96.0
dtype: float64

In [40]:
# 通过二维数组创建DataFrame
df01=DataFrame([['Tom','Gerry','John'],[76,98,85]])

In [41]:
print(df01)

     0      1     2
0  Tom  Gerry  John
1   76     98    85

In [42]:
df02=DataFrame([
    ['Tom',76],
    ['Gerry',98],
    ['John',85]
],columns=[u'姓名',u'成绩'])

In [43]:
print(df02)

      姓名  成绩
0    Tom  76
1  Gerry  98
2   John  85

In [44]:
print(u'列索引：',df02.columns)

列索引： Index(['姓名', '成绩'], dtype='object')

In [45]:
print(u'行索引：',df02.index)

行索引： RangeIndex(start=0, stop=3, step=1)

In [48]:
print(u'数据：\n',df02.values)

数据：
 [['Tom' 76]
 ['Gerry' 98]
 ['John' 85]]

In [49]:
# 自定义索引值
arr=np.array([
    ['Tom',75],
    ['Gerry',98],
    ['John',85]
])
df03=DataFrame(arr,index=['one','two','three'],columns=['name','score'])

In [50]:
print(df03)

        name score
one      Tom    75
two    Gerry    98
three   John    85

In [51]:
#通过字典创建
dic={
    '语文':[70,80,90],
    '数学':[80,88,90],
    '英语':[80,78,88]
}
df04=pd.DataFrame(dic)

In [52]:
print(df04)

   语文  数学  英语
0  70  80  80
1  80  88  78
2  90  90  88

In [53]:
df04.index=['one','two','three']#自定义索引
print(df04)

       语文  数学  英语
one    70  80  80
two    80  88  78
three  90  90  88

In [54]:
df04.reset_index(drop=True)#重置索引，并且删除原索引

   语文  数学  英语
0  70  80  80
1  80  88  78
2  90  90  88

In [55]:
df04.columns=list('abc')#重置列索引
print(df04)

        a   b   c
one    70  80  80
two    80  88  78
three  90  90  88

In [56]:
df03=pd.DataFrame(np.random.randint(1,9,(3,3)),index=list('ABC'),columns=list('abc'))

In [57]:
print(df03)

   a  b  c
A  1  2  6
B  5  2  6
C  6  6  6

In [58]:
# 列选择
print(df03['a'])

A    1
B    5
C    6
Name: a, dtype: int32

In [60]:
print(df03[['a','b']])

   a  b
A  1  2
B  5  2
C  6  6

In [61]:
# 列修改
df03['d']=[1,2,3]
print(df03)

   a  b  c  d
A  1  2  6  1
B  5  2  6  2
C  6  6  6  3

In [62]:
# 列添加
df03['d']=[10,11,12]
print(df03)

   a  b  c   d
A  1  2  6  10
B  5  2  6  11
C  6  6  6  12

In [63]:
# 列删除
del(df03['d'])
print(df03)

   a  b  c
A  1  2  6
B  5  2  6
C  6  6  6

In [65]:
# 行选择
print(df03.loc['A'])

a    1
b    2
c    6
Name: A, dtype: int32

In [66]:
# 选择多行
print(df03.loc['A':'B'])

   a  b  c
A  1  2  6
B  5  2  6

In [67]:
# 选择某行某列
print(df03.loc['A','c'])

6

In [68]:
print(df03.loc['A':'B','b'])

A    2
B    2
Name: b, dtype: int32

In [69]:
print(df03.loc['A':'B','b':'c'])

   b  c
A  2  6
B  2  6

In [71]:
print(df03.loc[:,'b':'c'])

   b  c
A  2  6
B  2  6
C  6  6

In [72]:
# 通过数字下标选择
print(df03.iloc[1])

a    5
b    2
c    6
Name: B, dtype: int32

In [74]:
print(df03.iloc[0:3,1:3])

   b  c
A  2  6
B  2  6
C  6  6

In [75]:
# 行添加
data=pd.DataFrame([[22,33,44]],index=['F'],columns=['a','b','c'])
df03=df03.append(data)

In [76]:
print(df03)

    a   b   c
A   1   2   6
B   5   2   6
C   6   6   6
F  22  33  44

In [77]:
#行修改
df03.loc['A']=[10,100,1000]

In [78]:
print(df03)

    a    b     c
A  10  100  1000
B   5    2     6
C   6    6     6
F  22   33    44

In [79]:
df03.loc['A':'C']=[9,99,999]

In [80]:
print(df03)

    a   b    c
A   9  99  999
B   9  99  999
C   9  99  999
F  22  33   44

In [81]:
# 行删除
df03=df03.drop('F')

In [82]:
print(df03)

   a   b    c
A  9  99  999
B  9  99  999
C  9  99  999

In [83]:
# 读取文件
df=pd.read_csv('data1.csv')

In [84]:
print(df)

    name  age  source
0  gerry   18    98.5
1    tom   21    78.2
2   lili   24    98.5
3   john   20    89.2

In [86]:
# 指定属性分隔符“;”，不读取头部数据
df01=pd.read_csv("data2.txt",sep=';',header=None)

In [87]:
print(df01)

       0   1     2     3     4
0  gerry  18  98.5  89.5  88.5
1    tom  21  98.5  85.5  80.0
2   lili  20  85.6  86.2   NaN
3   john  18  70.0  85.0  60.0
4    joe  19  80.0  85.0  82.0

In [88]:
# 数据文件存储
df.to_csv('data01.csv')

In [89]:
df01.to_csv("data02.txt",sep=';',header=None)

In [90]:
datas={
    'name':['aaa','bbb','ccc'],
    'age':[70,80,90],
    '语文':[70,80,88],
    '数学':[82,78,80],
    '英语':[86,88,90]
}
df=pd.DataFrame(datas)

In [91]:
print(df)

  name  age  语文  数学  英语
0  aaa   70  70  82  86
1  bbb   80  80  78  88
2  ccc   90  88  80  90

In [92]:
# 只选取成绩的列生成新的DataFrame
print(df.columns)

Index(['name', 'age', '语文', '数学', '英语'], dtype='object')

In [103]:
df[['数学','语文','英语']]

   数学  语文  英语
0  82  70  86
1  78  80  88
2  80  88  90

In [104]:
df[df.columns[2:]]

   语文  数学  英语
0  70  82  86
1  80  78  88
2  88  80  90

# 缺失值NaN处理方法

In [105]:
df2=DataFrame([
    ['Tom',np.nan,456.67,'M'],
    ['Merry',34,345.55,np.nan],
    ['Gerry',np.nan,np.nan,np.nan],
    ['John',23,np.nan,'M'],
    ['Joe',18,385.12,'F']
],columns=['name','age','salary','gender'])

In [106]:
print(df2)

    name   age  salary gender
0    Tom   NaN  456.67      M
1  Merry  34.0  345.55    NaN
2  Gerry   NaN     NaN    NaN
3   John  23.0     NaN      M
4    Joe  18.0  385.12      F

In [107]:
print(df2.isnull())

    name    age  salary  gender
0  False   True   False   False
1  False  False   False    True
2  False   True    True    True
3  False  False    True   False
4  False  False   False   False

In [109]:
print(df2.notnull())

   name    age  salary  gender
0  True  False    True    True
1  True   True    True   False
2  True  False   False   False
3  True   True   False    True
4  True   True    True    True

In [110]:
df3=DataFrame([
    [70,'aaa',82,86,70],
    [80,'bbb',78,88,80],
    [90,'ccc',80,90,88]
],columns=['age','name','数学','英语','语文'])

In [111]:
print(df3)

   age name  数学  英语  语文
0   70  aaa  82  86  70
1   80  bbb  78  88  80
2   90  ccc  80  90  88

In [116]:
df3.loc[2,'英语']=np.nan
df3.loc[1,'name']=np.nan
df3.loc[3]=np.nan
df3['address']=np.nan

In [117]:
print(df3)

    age name    数学    英语    语文  address
0  70.0  aaa  82.0  86.0  70.0      NaN
1  80.0  NaN  78.0  88.0  80.0      NaN
2  90.0  ccc  80.0   NaN  88.0      NaN
3   NaN  NaN   NaN   NaN   NaN      NaN

In [130]:
df4=df3.dropna()#默认删除只包含NaN的行
df4=df3.dropna(axis=1)#删除只包含NaN的列
df4=df3.dropna(how='all',axis=1)#删除所有的元素为NaN的行或列

In [131]:
print(df4)

    age name    数学    英语    语文
0  70.0  aaa  82.0  86.0  70.0
1  80.0  NaN  78.0  88.0  80.0
2  90.0  ccc  80.0   NaN  88.0
3   NaN  NaN   NaN   NaN   NaN

In [134]:
df5=pd.DataFrame(np.random.randint(1,5,(5,3)))
df5.loc[1:3,1]=np.nan
df5.loc[2,2]=np.nan

In [135]:
print(df5)

   0    1    2
0  1  4.0  3.0
1  3  NaN  4.0
2  1  NaN  NaN
3  1  NaN  1.0
4  1  1.0  3.0

In [136]:
df5.fillna(0)#填充所有的NaN为0

   0    1    2
0  1  4.0  3.0
1  3  0.0  4.0
2  1  0.0  0.0
3  1  0.0  1.0
4  1  1.0  3.0

In [137]:
df5.fillna(method='ffill')#向前填充

   0    1    2
0  1  4.0  3.0
1  3  4.0  4.0
2  1  4.0  4.0
3  1  4.0  1.0
4  1  1.0  3.0

In [138]:
df5.fillna(method='bfill')#向后填充

   0    1    2
0  1  4.0  3.0
1  3  1.0  4.0
2  1  1.0  1.0
3  1  1.0  1.0
4  1  1.0  3.0

In [139]:
df5.fillna({1:100,2:0})#替换填充

   0      1    2
0  1    4.0  3.0
1  3  100.0  4.0
2  1  100.0  0.0
3  1  100.0  1.0
4  1    1.0  3.0

In [140]:
df5.replace({np.nan:'haha'})#替换

   0     1     2
0  1     4     3
1  3  haha     4
2  1  haha  haha
3  1  haha     1
4  1     1     3

In [144]:
df=pd.DataFrame({
    'GDP':[900,1000,1100,1200,1300],
    'foreign_Trade':[300,400,500,550,600],
    'year':['2012','2013','2014','2015','2016']
})

In [145]:
print(df)

    GDP  foreign_Trade  year
0   900            300  2012
1  1000            400  2013
2  1100            500  2014
3  1200            550  2015
4  1300            600  2016

In [142]:
df.cov()

                   GDP  foreign_Trade
GDP            25000.0        18750.0
foreign_Trade  18750.0        14500.0

In [143]:
df['GDP'].cov(df['foreign_Trade'])

18750.0

In [146]:
df.corr()

                    GDP  foreign_Trade
GDP            1.000000       0.984798
foreign_Trade  0.984798       1.000000

In [148]:
df['GDP'].corr(df['foreign_Trade'])

0.9847982464479191

# 唯一值以及成员资格

In [149]:
ser=Series(['a','b','c','d','a','a','c','b'])

In [150]:
print(ser)

0    a
1    b
2    c
3    d
4    a
5    a
6    c
7    b
dtype: object

In [151]:
print(ser.unique())#去重

['a' 'b' 'c' 'd']

In [152]:
df=pd.DataFrame({
    'order_id':['1001','1002','1003','1004','1005','1006'],
    'member_id':['a01','a02','a03','a01','a02','a03'],
    'order_amt':[80,90,70,79,88,90]
})

In [153]:
print(df)

  order_id member_id  order_amt
0     1001       a01         80
1     1002       a02         90
2     1003       a03         70
3     1004       a01         79
4     1005       a02         88
5     1006       a03         90

In [155]:
print('下单用户：')
print(df['member_id'].unique())

下单用户：
['a01' 'a02' 'a03']

In [156]:
ser02=pd.Series(np.random.randint(1,5,9))

In [157]:
print(ser02)

0    2
1    1
2    1
3    3
4    4
5    2
6    2
7    1
8    1
dtype: int32

In [160]:
# 计算出现的次数
print(ser02.value_counts())

1    4
2    3
4    1
3    1
dtype: int64

In [161]:
df=pd.DataFrame({
    'order_id':['1001','1002','1003','1004','1005','1006'],
    'member_id':['a01','a02','a03','a01','a02','a03'],
    'order_amt':[80,90,70,79,88,90]
})

In [162]:
print(df)

  order_id member_id  order_amt
0     1001       a01         80
1     1002       a02         90
2     1003       a03         70
3     1004       a01         79
4     1005       a02         88
5     1006       a03         90

In [163]:
print('用户下单次数：')
print(df['member_id'].value_counts())

用户下单次数：
a02    2
a01    2
a03    2
Name: member_id, dtype: int64

In [164]:
ser02=pd.Series(['a','b','c','a','b','c','a'])

In [165]:
print(ser02)

0    a
1    b
2    c
3    a
4    b
5    c
6    a
dtype: object

In [166]:
#in

In [167]:
mask=ser02.isin(['b','c'])

In [168]:
print(mask)

0    False
1     True
2     True
3    False
4     True
5     True
6    False
dtype: bool

In [169]:
# 选出b,c项
ser02[mask]

1    b
2    c
4    b
5    c
dtype: object

In [170]:
# 取反
mask=~ser02.isin(['b','c'])

In [171]:
print(mask)

0     True
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [172]:
# 选出不是b,c项
print(ser02[mask])

0    a
3    a
6    a
dtype: object

In [173]:
data=pd.Series([100,200,122,150,180],index=[
    ['2016','2016','2016','2017','2017'],
    ['苹果','香蕉','西瓜','苹果','西瓜']
])

In [174]:
print(data)

2016  苹果    100
      香蕉    200
      西瓜    122
2017  苹果    150
      西瓜    180
dtype: int64

In [175]:
print(data['2016'])

苹果    100
香蕉    200
西瓜    122
dtype: int64

In [177]:
print(data[:,'苹果'])

2016    100
2017    150
dtype: int64

# 交换分层索引

In [178]:
data01=data.swaplevel().sort_index()

In [179]:
print(data01)

苹果  2016    100
    2017    150
西瓜  2016    122
    2017    180
香蕉  2016    200
dtype: int64

# 转变为DataFrame索引的堆

In [186]:
data02=data.unstack(level=1)

In [187]:
print(data02)

         苹果     西瓜     香蕉
2016  100.0  122.0  200.0
2017  150.0  180.0    NaN

In [188]:
print(data02.stack(level=0))

2016  苹果    100.0
      西瓜    122.0
      香蕉    200.0
2017  苹果    150.0
      西瓜    180.0
dtype: float64

# DataFrame的分层索引

In [189]:
df=pd.DataFrame({
    'year':[2011,2011,2011,2012,2012,2012,2013,2013],
    'fruit':['apple','banana','pear','apple','banana','pear','apple','banana'],
    'production':[2345,3214,1324,5563,2341,1536,3523,2330],
    'profits':[233.44,355.23,100.03,566.45,678.69,97.02,755.89,500.08]
})

In [190]:
print(df)

   year   fruit  production  profits
0  2011   apple        2345   233.44
1  2011  banana        3214   355.23
2  2011    pear        1324   100.03
3  2012   apple        5563   566.45
4  2012  banana        2341   678.69
5  2012    pear        1536    97.02
6  2013   apple        3523   755.89
7  2013  banana        2330   500.08

# 设置分层索引

In [191]:
df02=df.set_index(['year','fruit'])

In [192]:
print(df02)

             production  profits
year fruit
2011 apple         2345   233.44
     banana        3214   355.23
     pear          1324   100.03
2012 apple         5563   566.45
     banana        2341   678.69
     pear          1536    97.02
2013 apple         3523   755.89
     banana        2330   500.08

# 交换分层索引

In [193]:
df02.swaplevel().sort_index()

             production  profits
fruit  year
apple  2011        2345   233.44
       2012        5563   566.45
       2013        3523   755.89
banana 2011        3214   355.23
       2012        2341   678.69
       2013        2330   500.08
pear   2011        1324   100.03
       2012        1536    97.02

# 获取数据

In [194]:
df02.loc[2011,'apple']

production    2345.00
profits        233.44
Name: (2011, apple), dtype: float64

In [195]:
df02.loc[:,'profits']

year  fruit
2011  apple     233.44
      banana    355.23
      pear      100.03
2012  apple     566.45
      banana    678.69
      pear       97.02
2013  apple     755.89
      banana    500.08
Name: profits, dtype: float64

In [197]:
df03=df02.unstack()
print(df03)

      production                 profits
fruit      apple  banana    pear   apple  banana    pear
year
2011      2345.0  3214.0  1324.0  233.44  355.23  100.03
2012      5563.0  2341.0  1536.0  566.45  678.69   97.02
2013      3523.0  2330.0     NaN  755.89  500.08     NaN

In [198]:
df03.loc[:,'production']['apple']

year
2011    2345.0
2012    5563.0
2013    3523.0
Name: apple, dtype: float64

In [199]:
df03.stack(level=0)

fruit              apple   banana     pear
year
2011 production  2345.00  3214.00  1324.00
     profits      233.44   355.23   100.03
2012 production  5563.00  2341.00  1536.00
     profits      566.45   678.69    97.02
2013 production  3523.00  2330.00      NaN
     profits      755.89   500.08      NaN

# 根据行索引统计

In [200]:
df02.sum(level='fruit')#求和

        production  profits
fruit
apple        11431  1555.78
banana        7885  1534.00
pear          2860   197.05

In [201]:
df02.mean(level='year')#求平均值

       production     profits
year
2011  2294.333333  229.566667
2012  3146.666667  447.386667
2013  2926.500000  627.985000

In [202]:
df02.min(level=['fruit','year'])#求最小值

             production  profits
fruit  year
apple  2011        2345   233.44
banana 2011        3214   355.23
pear   2011        1324   100.03
apple  2012        5563   566.45
banana 2012        2341   678.69
pear   2012        1536    97.02
apple  2013        3523   755.89
banana 2013        2330   500.08

In [203]:
ser1=pd.Series(np.arange(0,4),index=['b','c','d','a'])

In [204]:
print(ser1)

b    0
c    1
d    2
a    3
dtype: int32

In [205]:
ser1.sort_index()#通过列或者行索引进行排序

a    3
b    0
c    1
d    2
dtype: int32

In [206]:
ser1.sort_index(ascending=False)#倒序  由大到小

d    2
c    1
b    0
a    3
dtype: int32

In [207]:
df=pd.DataFrame(np.random.randint(1,9,(4,4)),
                columns=['b','c','a','d'],
                index=['B','D','A','C'])

In [208]:
print(df)

   b  c  a  d
B  4  3  1  2
D  5  2  4  1
A  7  5  2  4
C  3  8  1  6

In [209]:
df.sort_index()#通过行索引排序

   b  c  a  d
A  7  5  2  4
B  4  3  1  2
C  3  8  1  6
D  5  2  4  1

In [210]:
df.sort_index(axis=1)#通过列索引进行排序

   a  b  c  d
B  1  4  3  2
D  4  5  2  1
A  2  7  5  4
C  1  3  8  6

In [211]:
df.sort_index(axis=1,ascending=False)#通过列索引倒序排序

   d  c  b  a
B  2  3  4  1
D  1  2  5  4
A  4  5  7  2
C  6  8  3  1

In [212]:
ser1.sort_values()

b    0
c    1
d    2
a    3
dtype: int32

In [213]:
df.sort_values(by=['d','b'])#通过某列的值进行排序

   b  c  a  d
D  5  2  4  1
B  4  3  1  2
A  7  5  2  4
C  3  8  1  6

In [214]:
df.sort_values(by='B',axis=1)

   a  d  c  b
B  1  2  3  4
D  4  1  2  5
A  2  4  5  7
C  1  6  8  3

In [215]:
df.sort_values(by='C',axis=1,ascending=False)

   c  d  b  a
B  3  2  4  1
D  2  1  5  4
A  5  4  7  2
C  8  6  3  1

In [216]:
df.sort_values(by=['C','B'],axis=1,ascending=False)

   c  d  b  a
B  3  2  4  1
D  2  1  5  4
A  5  4  7  2
C  8  6  3  1